eisup_2019_docmng_integration/src/Catalogs/ввв_МестонахождениеБиллинга/ввв_МестонахождениеБиллинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ввв_МестонахождениеБиллинга</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>абс_ПрефиксТаблицВTPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксТаблицыНачисленияВTPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксСессииНачисленияВTPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксТаблицыПлатежейВTPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксСессииПлатежейВTPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияУчета</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБиллинга</name>
    <type>
      <types>CatalogRef.абс_ТипыБиллинга</types>
    </type>
  </attributes>
  <attributes>
    <name>КураторПоУмолчанию</name>
    <type>
      <types>CatalogRef.абс_Кураторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБиллинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БиллингМГМН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БратьЦФУиЦФОПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПоУмолчанию</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьИсториюСтарыхЗагрузокИзЛогов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегистрИсторииЗагрузок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНумерациюСчетовНаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСписокЛицевыхСчетовНаОдномДоговоре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоСтатусКорректировкиРеализации</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегистрИсторииЗагрузокДляУчетаЦФОиЦФУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьЗаказыВ1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьПрефиксКНомеруСчетаНаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированнаяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированныйКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированныйДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗачитыватьАванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Операторы</name>
    <attributes>
      <name>КодОператора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оператор</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АгентскийДоговор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоНеАгент</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектронныйАдресДляИнформирования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОтветственного</name>
      <type>
        <types>EnumRef.ttk_ТипыОтветственныхПриЗагрузкеБиллинга</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоОтветственности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеОтветственности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/ввв_МестонахождениеБиллинга/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура БратьЦФУиЦФОПоУмолчаниюПриИзменении(Элемент)
	
	Элементы.ЦФО.Доступность = Объект.БратьЦФУиЦФОПоУмолчанию;
	Элементы.ЦФУ.Доступность = Объект.БратьЦФУиЦФОПоУмолчанию;
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегированнаяЗагрузкаПриИзменении(Элемент)
	
	Элементы.АгрегированныйДоговор.Доступность = Объект.АгрегированнаяЗагрузка;
	Элементы.АгрегированныйКонтрагент.Доступность = Объект.АгрегированнаяЗагрузка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БратьЦФУиЦФОПоУмолчаниюПриИзменении(Элементы.БратьЦФУиЦФОПоУмолчанию);
	АгрегированнаяЗагрузкаПриИзменении(Элементы.АгрегированнаяЗагрузка);
	
КонецПроцедуры
